{"meta":{"title":"间歇泉下","subtitle":"","description":"","author":"Mahayu","url":"https://mahayu.github.io","root":"/"},"pages":[],"posts":[{"title":"较为极限情形下的nVIDIA MX系显卡表现（以原神为例）","slug":"game_data1","date":"2022-05-03T19:35:40.000Z","updated":"2022-01-13T21:53:36.208Z","comments":true,"path":"2022/05/04/game_data1/","link":"","permalink":"https://mahayu.github.io/2022/05/04/game_data1/","excerpt":"","text":"Disclaimer 正文之前，笔者认为有必要声明：确实有很多理由可以对被测试的游戏亦或是相关群体进行批评，但是这和本文及本文作者毫无关系。如果读者对这些内容感兴趣，大可移驾别处。 前言 环境设置 测试用例 具体表现 引导阶段&amp;周边游览 野外小规模战斗 副本两则 风起地大树夜景 数据分析 总结 前言一个显而易见的事实是：在一般价位段上，搭载独显的机型总比纯核显（下称UMA机器）畅销。个中原因已有很多文章解析，此处不再赘述。 显然这些搭载独显的机器的性能释放不会太过理想。在应对游戏时压力尤甚。 本文将以性能释放较保守的 惠普 战66 四代 (ProBook 440 G8)为例，探讨在较为严格的限制下、MX450显卡运行《原神》时的性能表现。 环境设置测试机核心配置为 HP ProBook 440 G8 i5-1135G7/MX450 GDDR5 2G（12W） 16GiB RAM/512G SSD Windows 10 1903 室温23℃ 测试软件为HwInfo_715_4620，配合Fraps以抓取实时帧率。 游戏默认图像质量为“低”，手动修改帧率上线为60帧数。修改后结果如下图所示。 测试用例时间所限，测试用例仅包含以下几项： 游戏开始时的引导阶段/蒙德城周边游览 野外小规模战斗 副本两则 风起地大树夜景 具体表现以折线图的形式表现时间与帧率、CPU功耗\\GPU Core(NVDDD)Output Power的关系。 引导阶段&amp;周边游览 野外小规模战斗 副本两则 风起地大树夜景 数据分析 引导阶段&amp;周边游览 帧率能保持在60帧左右。要注意到的是相对于双烤成绩，CPU功耗总是保持在一个较高的水平，而GPU功耗则根据画面的复杂度不同而波动。 野外小规模战斗 由于流程较短、场景简单，整体帧率没有较大的波动。其中GPU功耗有一个尖峰，应当是视光特效堆积所造成的。在后文会详细分析。 副本两则 副本分为解谜和战斗两部分。 解谜环节的帧率几乎没有波动，同时GPU功耗比大世界下游览的功耗要显著低，符合一般性逻辑（场景相对较简单）。CPU功耗仍然维持在一个较高水平。 战斗部分出现了较严重的掉帧现象。 副本1当中可以观察到帧数下降沿发生时，GPU功耗并没有上拉的迹象、而CPU功耗有对应的尖峰。推测并非是视光特效堆积造成的效果。 副本2中掉帧下降沿发生时有显著的GPU功耗上升，可判定为视光特效过多所造成的。 注意到两个副本中帧数下降沿发生时，CPU功耗都有尖峰。具体原因限于本人知识所限，无法给出对应的解答。 风起地大树夜景 帧率呈凹字形，相应的GPU功耗呈凸字形——显然是因为远景渲染过程所导致的，符合一般性逻辑。 总结除开一些战斗场景的掉帧外，这块相对低功耗的MX450表现还是出乎笔者意料的。即使是比较耗费资源的远景观测，在渲染完毕之后的帧数也非常理想。 理论上来说战66这款机器的性能释放在同等定位产品中应当属于较差的（双烤15W+20W）；既然极端情况下的效果尚可，那一般情况下的MX450……甚至是下一代iGPU的表现只会更好。诸如Thinkbook14这样强调性能释放的UMA机器或许会获得更大的优势。 属于UMA的时代终将到来。","categories":[],"tags":[]},{"title":"云修理#1","slug":"repair1","date":"2021-09-03T22:22:10.000Z","updated":"2021-09-12T12:42:16.429Z","comments":true,"path":"2021/09/04/repair1/","link":"","permalink":"https://mahayu.github.io/2021/09/04/repair1/","excerpt":"","text":"应该算是开新坑……那么就直接开始。 屏摄预警 接到问题 初步诊断 深入问题 解决问题 一些碎碎念 接到问题属于是网络相关。经典无线网络显示叉号，无法联网。 初步诊断进一步询问了一下其他设备访问网络的情况，报告是一切畅通。有理由认为是IP配置出了一点问题，不过保险起见还是先用自带的疑难解答诊断下。 不出所料是IP问题，直接让他去对应页面调整。 手动配置结果啥也不填可还行，果断让他选择自动获得、然后给了一个114.114.114.114的DNS。 深入问题确认了之后仍然报告无法联网。尝试查询网络的具体状态： 169.254.*，分配了保留地址。考虑到手机能够正常上网……归根到底是本机的DHCP服务出了点问题，方便起见直接配置个静态IP完事。 首先要拿到网段，找一个正常运作的终端、查询一下IP地址就行了。这里利用的是对方的手机： 行，应该是192.168.0.* 、手动配置IP和网关即可。 IP地址给的是192.168.0.12，网关反正是192.168.0.1。 解决问题确认以后就没有显示问号了，结果还是不能正常的浏览网页。尝试ping了一下DNS： 显然是连接上网了，但是DNS查询失败……显然DNS服务器不太可能宕机，那看来是Winsock出了点问题。 执行命令 netsh winsock reset 即可。 要注意的是这里不需要重启即可观察修改效果。 可以查询到域名对应的IP地址了，那浏览也不成问题。 一些碎碎念事后想了下其实最好还是修复本机的DHCP服务比较好。（连接其他网络的时候不会出问题） ……当时事急从权就直接用静态IP直接上了orz","categories":[],"tags":[]},{"title":"Statement","slug":"statement","date":"2020-06-07T13:41:10.000Z","updated":"2020-09-05T11:04:58.320Z","comments":true,"path":"2020/06/07/statement/","link":"","permalink":"https://mahayu.github.io/2020/06/07/statement/","excerpt":"","text":"这里放置的是2un一些访谈的节选，没有顺序之分。 以下内容截取自 「东方外来韦编 / 肆 / 风神录访谈」@THBwiki 网络时代是非常有意思的。一旦游戏或者动画有了什么出名的作品，人们过去拥有的印象就会被改写。即使在当时非常小众的信息其情报量会逐渐增加，这样一来后来才接触作品的人，也能迅速掌握知识，不知不觉间这件事就成为了常识。 不过，我是不会把一些故事当作「事实」讲述的，我希望大家能够记住这一点。因为也有可能原本并非事实的事情，由于不慎被一些学说采用结果成为了事实。 ……天津瓮星正因为是在「女神转生」系列里登场过，所以在网上才会变得有名或者说情报增多了吧。我当时觉得还真是出现了一个小众的神明，在当时只有一种一定是什么人有意而为之的印象。经过了一系列展开以后，这些都成了常识的一部分。 以下内容截取自「东方外来韦编 / 2018 Spring! / ZUN 访谈」@THBwiki 既然作为配套推出，那么故事也自成一体可能令角色更有受众。不过从故事的角度上来说配套会耽误很多事情，会在后来感到困扰。 在二次创作不断增加的过程中，通过二次创作进入东方的人也增加了。如今这已经是理所当然的事了，很多人都觉得这是件好事，但当时好多人都说这是件坏事。当时我就在摸索原作到底该干些什么、到底什么样的东西才是东方，创造一条道路。这不仅仅是东方而是所有作品都在做的事情，在此之中，思考东方到底能做到什么。一个人开发游戏是有极限的，明确的答案是不存在的，不过倒也不是不存在。 制作的人很痛苦，思考了很多又呕心沥血的，我觉得这样的游戏不会好玩。如果制作大规模的作品又是另一码事了，但小规模开发的独立游戏，我开始觉得制作的人必须表现出制作游戏的乐趣。我觉得这是绝对重要的。我并不是说之前的作品制作起来不开心，但相对于我以前经常表现出游戏制作的辛苦，现在已经不同了。更简单的「我现在想制作所以就制作了」这样感觉更好。「星莲船」是我会这样思考的契机吧。","categories":[],"tags":[]},{"title":"初始化","slug":"Init","date":"2020-05-03T22:26:06.000Z","updated":"2021-09-04T01:23:46.903Z","comments":true,"path":"2020/05/04/Init/","link":"","permalink":"https://mahayu.github.io/2020/05/04/Init/","excerpt":"","text":"那么应该就算是搭建好了。。域名的事情到时候再安排，不是很急。 应该会随缘更新的，电玩摸鱼之间的空隙大概就是用来写这个了。总而言之，这玩意是个人博客而不是别的什么、因此风格会相当随意和散漫。 以后博客的样式可能会作调整（先用现成的主题），不过文章应该会保留下来。 等待完善的功能： 评论（会有人评论吗？），暂时使用别人的评论系统。 标签。但是这个功能不太紧急……反正是杂物堆放处，用搜索功能就行了。 利用Github的Private Repo存储主题文件。（用处不大，历史版本没什么用。） 清理主题中的多余文件（一些svg和字体），已在2020/05/04完成。 现有主题的进一步客制化。现在已经比较完善就是了，有时间好好读下代码。 所使用的版权声明，已在2020/05/05完成。 不会完善的功能 关于。笔者倾向于让这里的内容不受身份干扰。 其余的功能 没精力做 没必要 页面元素会很乱 这个页面会一直保持更新。","categories":[],"tags":[]}],"categories":[],"tags":[]}